---
type: ConduitSettings
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 8
tags: [revit-api, class]
---

# ConduitSettings

`Autodesk.Revit.DB.Electrical.ConduitSettings` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetConduitSettings | 2017 | `public static ConduitSettings GetConduitSettings ( Document document )` |
| Property | ConnectorSeparator | 2017 | `public string ConnectorSeparator { get ; set ; }` |
| Property | FittingAnnotationSize | 2017 | `public double FittingAnnotationSize { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RiseDropAnnotationSize | 2017 | `public double RiseDropAnnotationSize { get ; set ; }` |
| Property | SizePrefix | 2017 | `public string SizePrefix { get ; set ; }` |
| Property | SizeSuffix | 2017 | `public string SizeSuffix { get ; set ; }` |
| Property | UseAnnotationScaleForSingleLineFittings | 2017 | `public bool UseAnnotationScaleForSingleLineFittings { get ; set ; }` |